In [1]:
import pandas as pd

In [2]:
data = {
    'Product_ID': [1, 2, 3, 4, 5, 6, 1, 2, 3, 4],
    'Product_Name': ['Toothpaste', 'Shampoo', 'Laptop', 'TV', 'Coffee Maker', 'Blender', 'Toothpaste', 'Shampoo', 'Laptop', 'TV'],
    'Category': ['Personal Care', 'Personal Care', 'Electronics', 'Electronics', 'Kitchen Appliances', 'Kitchen Appliances', 'Personal Care', 'Personal Care', 'Electronics', 'Electronics'],
    'Price': [5.0, 10.0, 1000.0, 600.0, 50.0, 30.0, 5.0, 10.0, 1000.0, 600.0],
    'Units_Sold': [100, 50, 20, 15, 30, 25, 110, 55, 22, 17]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25
6           1    Toothpaste       Personal Care     5.0         110
7           2       Shampoo       Personal Care    10.0          55
8           3        Laptop         Electronics  1000.0          22
9           4            TV         Electronics   600.0          17

### UNIQUE

#### How many unique Product_IDs are there in the DataFrame?

In [5]:
len(df.loc[:, 'Product_ID'].unique())

6

#### What are the unique product categories available in the DataFrame?

In [6]:
list(pd.unique(df.loc[:, 'Category']))

['Personal Care', 'Electronics', 'Kitchen Appliances']

#### How many different price points are in the DataFrame?

In [7]:
len(pd.unique(df.loc[:, 'Price']))

6

#### Are there any products that were sold in different units (check for unique 'Units_Sold')?

In [8]:
len(pd.unique(df.loc[:, 'Units_Sold']))

10

#### How many unique combinations of 'Product_ID' and 'Price' are there?

In [11]:
df

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25
6           1    Toothpaste       Personal Care     5.0         110
7           2       Shampoo       Personal Care    10.0          55
8           3        Laptop         Electronics  1000.0          22
9           4            TV         Electronics   600.0          17

In [9]:
#
# pd.unique can be applied to only single dimension,
# we can convert the dataframe of two columns to a series of tuples
# Then we can applu unique to the unique pair

In [17]:
df[['Product_ID', 'Price']].drop_duplicates()

   Product_ID   Price
0           1     5.0
1           2    10.0
2           3  1000.0
3           4   600.0
4           5    50.0
5           6    30.0

In [18]:
df[['Product_ID', 'Price']]

   Product_ID   Price
0           1     5.0
1           2    10.0
2           3  1000.0
3           4   600.0
4           5    50.0
5           6    30.0
6           1     5.0
7           2    10.0
8           3  1000.0
9           4   600.0

#### Are all 'Units_Sold' for 'Toothpaste' the same or are there unique values?

In [28]:
pd.unique(df.loc[df['Product_Name'] == 'Toothpaste', 'Units_Sold'])

array([100, 110])

### N_UNIQUE

#### How many unique categories of products does the Target store offer? Use nunique() to find out.

In [30]:
df.nunique()['Category']

3

#### How many different unique price points exist for 'Electronics' in the DataFrame? Use nunique() to get the answer.

In [31]:
df

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25
6           1    Toothpaste       Personal Care     5.0         110
7           2       Shampoo       Personal Care    10.0          55
8           3        Laptop         Electronics  1000.0          22
9           4            TV         Electronics   600.0          17

In [37]:
df.loc[df['Category'] == 'Electronics', ['Price']]

    Price
2  1000.0
3   600.0
8  1000.0
9   600.0

In [36]:
df.loc[df['Category'] == 'Electronics', ['Price']].nunique()

Price    2
dtype: int64

#### Are the units in which products sold always unique, or do some products share the same number of 'Units_Sold'? Use nunique() to determine this.

In [38]:
df

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25
6           1    Toothpaste       Personal Care     5.0         110
7           2       Shampoo       Personal Care    10.0          55
8           3        Laptop         Electronics  1000.0          22
9           4            TV         Electronics   600.0          17

In [43]:
df.groupby('Product_Name')['Units_Sold'].sum(['Units_Sold']).reset_index()

   Product_Name  Units_Sold
0       Blender          25
1  Coffee Maker          30
2        Laptop          42
3       Shampoo         105
4            TV          32
5    Toothpaste         210

In [44]:
temp_df = df.groupby('Product_Name')['Units_Sold'].sum(['Units_Sold']).reset_index()

In [45]:
temp_df

   Product_Name  Units_Sold
0       Blender          25
1  Coffee Maker          30
2        Laptop          42
3       Shampoo         105
4            TV          32
5    Toothpaste         210

In [47]:
temp_df.drop_duplicates().nunique()

Product_Name    6
Units_Sold      6
dtype: int64

In [10]:
# No two products has same units sold

#### How many unique 'Product_ID' are there for products in the 'Personal Care' category? Utilize nunique() for this.

In [49]:
df.loc[df['Category'] == 'Personal Care', ['Product_ID']].nunique()

Product_ID    2
dtype: int64